---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallType
source: html/7cdf90c4-b7f9-63ce-4352-2b9403c0e376.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallType Property

Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateTaperedWallForWallType { get; }
```